app/views/posts/_form.html.erb

  <%= f.label :category_id %>
  <%= f.select :category_id, Category.all.collect {|p| [ p.name, p.id ] } %><br>
---
SELECT "categories".* FROM "categories"