app/views/posts/index.html.erb

  <p><%= post.content %>
  <p>by: <%= User.find(post.user_id).username %> on <%= post.created_at %><br><br>
  <%= post.comments.count %> comments<br>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 14]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = $1  [["post_id", 19]]