app/views/posts/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 29]]
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
  <h5><%= @post.title %></h5>
  <p>Posted By: <%= User.find(@post.user_id).username %></p>
  <p><%= @post.content %></p>
  <%= @post.comments.count %> comments