app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 31]]
INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "sfsddsfdsafsd"], ["created_at", "2014-12-15 13:29:45.057234"], ["post_id", 31], ["updated_at", "2014-12-15 13:29:45.057234"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 301]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "value", "votable_id", "votable_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-12-15 13:29:46.830824"], ["updated_at", "2014-12-15 13:29:46.830824"], ["user_id", 31], ["value", 1], ["votable_id", 301], ["votable_type", "Comment"]]
---
  def upvote
    @comment = Comment.find(params[:id])
    @comment.votes.create(value: 1, voter: current_user)

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 301]]
---
  def downvote
    @comment = Comment.find(params[:id])