app/controllers/posts_controller.rb

  def index
    if params[:search]
      @posts = Post.search(params[:search]).order("created_at DESC")
---
SELECT "posts".* FROM "posts"  WHERE (title like '%Weed%')  ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("category_id", "content", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category_id", 1], ["content", "I don't know what to type;"], ["created_at", "2014-12-15 12:49:37.683699"], ["title", "Idk"], ["updated_at", "2014-12-15 12:49:37.683699"], ["user_id", 31]]

  def update
    @post = Post.find(params[:id])
    @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 12]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = 12  [["content", "Blow"], ["updated_at", "2014-12-15 13:51:16.108927"]]

  def upvote
    @post = Post.find(params[:id])
    @post.votes.create(value: 1, voter: current_user)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "value", "votable_id", "votable_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-12-15 13:31:08.574667"], ["updated_at", "2014-12-15 13:31:08.574667"], ["user_id", 31], ["value", 1], ["votable_id", 1], ["votable_type", "Post"]]