app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY updated_at
---
  def index
    @post  = Post.all