app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'aa' LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."name" IS NULL LIMIT 1
---
  def create
<<<<<<< HEAD
    user = User.find_by(username: params[:session][:username])

    if user && user.authenticate(params[:session][:password])
      login(user)
      redirect_to posts_path
    else
    flash.now[:error] = "Invalid login"
    render :new
=======
    @current_user = User.find_by(name: params[:session][:user_name])