app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-12 23:27:48.021660"], ["password_digest", "$2a$10$XoHpn6WBT6wQ1eu1mzId4ehVvJ3MFuTvIdW.W1Lbw8UKT9S5Qk31W"], ["updated_at", "2014-12-12 23:27:48.021660"], ["username", "ali"]]
---
  def create
    @user = User.new(user_params)
    if @user.save